<?php
$conn = mysql_connect("localhost","root");
mysql_select_db("avtomobili");
mysql_query("INSERT INTO korisnici(ime,prezime,email,ovlastuvanje,datanaragjanje,brojulica,ulica,opstina,drzava,telefon,password) VALUES ('Бојан','Костов','bojan@yahoo.com','korisnik','1985-05-20','25','Скопска','Скопје','Македонија','070123456','".md5('1')."');");
mysql_query("insert into tipnamotor (tipnamotor) values('Бензин'),('Дизел');");
mysql_query("insert into menuvac(menuvac) values('Автоматски'),('Мануелен');");
mysql_query("insert into zafatninanamotor(zafatninanamotor) values('1.2'),('1.4'),('1.6'),('2.0'),('3.0'),('4.2'),('1.8'),('1.0');");
mysql_query("insert into tipnavozilo(tipnavozilo,brojnavrati) values('Хеџбек',4),('Малиградски',3),('Седани',4),('Каравани',5),('Моноволумен',5),('Теренци-SUV',5),('Кабриолети',2),('Купеа',3),('Спортски',3),('Спортбек',5),('Allroad',5);");
mysql_query("insert into proizvoditel(ime,proizvoditelslika) values('Фолксваген','sliki\\pocetna\\vw.png'),('Шкода','sliki\\pocetna\\skoda.png'),('Ауди','sliki\\pocetna\\audi.png'),('Сеат','sliki\\pocetna\\seat.png'),('Форд','sliki\\pocetna\\ford.jpg');");
mysql_query("insert into tipnakarticka values(1,'Master Card'),(2,'Maestro'),(3,'VISA/VISA Electron'),(4,'MK Domestic Card'),(5,'Diners Club');");
mysql_query("insert into korisnici(ime,prezime,email,ovlastuvanje,datanaragjanje,brojulica,ulica,opstina,drzava,telefon,password) VALUES ('Мартин','Монев','martin@makcar.com','admin','1993-04-15','13','Јанко Глигоров','Свети Николе','Македонија',078247410,md5('monev1'));");
mysql_query("insert into karticka values(3421475409321234,'Мартин','Монев','2018-06-01',1,772,1000000),(4321340503232566,'Антонио','Ристов','2017-03-01',3,864,100000),(0213455123456423,'Јован','Арсов','2016-11-01',2,643,230000),(1234567891234567,'Мартин','Монев','2018-06-01',1,772,1000000)");


mysql_query("INSERT INTO senzori VALUES('Сензори-за-дожд','450'),('Паркинг-сензори','400');");
mysql_query("INSERT INTO stakla VALUES('Затемнети-30%','300'),('Затемнети-45%','350'),('Затемнети-50%','400');");
mysql_query("INSERT INTO boja VALUES('Црвена','700'),('Плава','720'),('Бела','800'),('Портокалова','740'),('Зелена','850'),('Жолта','760'),('Црна','830');");
mysql_query("INSERT INTO svetla VALUES('Ксенон','500'),('Лед','560');");
mysql_query("INSERT INTO trkala VALUES('Michelin','16','600'),('Michelin','17','700'),('Michelin','18','800'),('GoodYear','16','700'),('GoodYear','17','800'),('GoodYear','18','900'),('Dunlop','16','600'),('Dunlop','17','700'),('Dunlop','18','800'),('Continental','16','600'),('Continental','17','700'),('Continental','18','800');");
mysql_query("INSERT INTO sedista VALUES('Кожен-салон','1000'),('Кожен-салон-со-греачи','1200');");






mysql_query("INSERT INTO vozila VALUES('ЦЦ','sliki//avtomobili//Volkswagen//volkswagen_CC.png','Фолксваген','Седани',''),
('Еос','sliki//avtomobili//Volkswagen//volkswagen_eos.png','Фолксваген','Кабриолети',''),
('Голф','sliki//avtomobili//Volkswagen//volkswagen_golf.png','Фолксваген','Хеџбек',''),
('Голф-Вариант','sliki//avtomobili//Volkswagen//volkswagen_golf_variant.png','Фолксваген','Каравани',''),
('Пасат','sliki//avtomobili//Volkswagen//volkswagen_passat.png','Фолксваген','Седани',''),
('Пасат-Вариант','sliki//avtomobili//Volkswagen//volkswagen_passat_variant.png','Фолксваген','Каравани',''),
('Фаетон','sliki//avtomobili//Volkswagen//volkswagen_phaeton.png','Фолксваген','Седани',''),
('Поло','sliki//avtomobili//Volkswagen//volkswagen_polo.png','Фолксваген','Малиградски',''),
('Шаран','sliki//avtomobili//Volkswagen//volkswagen_sharan.png','Фолксваген','Моноволумен',''),
('Буба','sliki//avtomobili//Volkswagen//volkswagen_the_beetle.png','Фолксваген','Малиградски',''),
('Тигуан','sliki//avtomobili//Volkswagen//volkswagen_tiguan.png','Фолксваген','Теренци-SUV',''),
('Туарег','sliki//avtomobili//Volkswagen//volkswagen_touareg.png','Фолксваген','Теренци-SUV',''),
('Туран','sliki//avtomobili//Volkswagen//volkswagen_touran.png','Фолксваген','Моноволумен',''),
('Уп','sliki//avtomobili//Volkswagen//volkswagen_up.png','Фолксваген','Малиградски','')");
mysql_query("INSERT INTO model VALUES('Бензин','1.4','Автоматски','ЦЦ','140','26700'),('Бензин','1.2','Мануелен','ЦЦ','120','25700'),('Дизел','1.6','Автоматски','ЦЦ','125','30700'),('Дизел','1.6','Мануелен','ЦЦ','180','32700'),('Бензин','1.4','Автоматски','Еос','140','32460'),('Бензин','1.2','Мануелен','Еос','120','31800'),('Дизел','1.6','Автоматски','Еос','125','40700'),('Дизел','1.6','Мануелен','Еос','180','42700'),('Бензин','1.4','Автоматски','Голф','140','24500'),('Бензин','1.2','Мануелен','Голф','120','23740'),('Дизел','1.6','Автоматски','Голф','125','31730'),('Дизел','1.6','Мануелен','Голф','180','35700'),('Бензин','1.4','Автоматски','Голф-Вариант','140','24700'),('Бензин','1.2','Мануелен','Голф-Вариант','120','28700'),('Дизел','1.6','Автоматски','Голф-Вариант','125','34560'),('Дизел','1.6','Мануелен','Голф-Вариант','180','38490'),('Бензин','1.4','Автоматски','Пасат','140','36700'),('Бензин','1.2','Мануелен','Пасат','120','38700'),('Дизел','1.6','Автоматски','Пасат','125','45900'),('Дизел','1.6','Мануелен','Пасат','180','48500'),('Бензин','1.4','Автоматски','Пасат-Вариант','140','36900'),('Бензин','1.2','Мануелен','Пасат-Вариант','120','37700'),('Дизел','1.6','Автоматски','Пасат-Вариант','125','40700'),('Дизел','1.6','Мануелен','Пасат-Вариант','180','44300'),('Бензин','1.4','Автоматски','Фаетон','140','33700'),('Бензин','1.2','Мануелен','Фаетон','120','34700'),('Дизел','1.6','Автоматски','Фаетон','125','38700'),('Дизел','1.6','Мануелен','Фаетон','180','41700'),('Бензин','1.4','Автоматски','Поло','140','14700'),('Бензин','1.2','Мануелен','Поло','120','13500'),('Дизел','1.6','Автоматски','Поло','125','16700'),('Дизел','1.6','Мануелен','Поло','180','17900'),('Бензин','1.4','Автоматски','Шаран','140','26700'),('Бензин','1.2','Мануелен','Шаран','120','25700'),('Дизел','1.6','Автоматски','Шаран','125','30700'),('Дизел','1.6','Мануелен','Шаран','180','32700'),('Бензин','1.4','Автоматски','Буба','140','26700'),('Бензин','1.2','Мануелен','Буба','120','25700'),('Дизел','1.6','Автоматски','Буба','125','30700'),('Дизел','1.6','Мануелен','Буба','180','32700'),('Бензин','4.2','Автоматски','Тигуан','240','55700'),('Бензин','4.2','Мануелен','Тигуан','260','57700'),('Дизел','3.0','Автоматски','Тигуан','180','60700'),('Дизел','3.0','Мануелен','Тигуан','220','63700'),('Бензин','4.2','Автоматски','Туарег','240','55700'),('Бензин','4.2','Мануелен','Туарег','260','57700'),('Дизел','3.0','Автоматски','Туарег','180','60700'),('Дизел','3.0','Мануелен','Туарег','220','63700'),('Бензин','1.4','Автоматски','Туран','140','30700'),('Бензин','1.4','Мануелен','Туран','260','32700'),('Дизел','2.0','Автоматски','Туран','120','35700'),('Дизел','2.0','Мануелен','Туран','160','40700'),('Бензин','1.0','Автоматски','Уп','80','9700'),('Бензин','1.2','Мануелен','Уп','90','10700'),('Дизел','1.4','Автоматски','Уп','90','12700'),('Дизел','1.6','Мануелен','Уп','110','14700')");


echo mysql_error();
echo "ok";

mysql_close($conn);




?>